#include <iostream>
#include <windows.h>
using namespace std;
int main()
{
    SetConsoleCP(65001);//1251
    SetConsoleOutputCP(65001);//1251
    char choice;
    cout << "Бажаєте зіграти? Якщо так, натисніть 'y', якщо ні, натисніть 'n'\n \n";
    cin >> choice;
    if (choice == 'y') {
        cout << "\nПочинаємо гру\n\n" << "ПЕРШЕ ПИТАННЯ\nЯкі числа належать до типу данних int?\na: Цілі             b: Дійсні\nc: Дробові          d: Від'ємні\n \n";
        cin >> choice;
        if (choice == 'a') {
            cout << "\n                  Вітаємо!!!\n  Ви виграли 100 грн.\n  Ви хочете забрати цю суму?\n  Якщо так, натисніть 'y', якщо ні, натисніть 'n'\n \n ";
            cin >> choice;
            if (choice == 'n') {
                cout << "\nПродовжуємо гру\n \nДРУГЕ ПИТАННЯ (Незгоряюча сума!)\nЯк позначається блок виконання операцій?\na: Трикутник           b: Ромб\nc: Прямокутник         d: Коло\n \n";
                cin >> choice;
                if (choice == 'c') {
                    cout << "\nВітаємо!!! Ви досягли другої незгоряючої суми у 1,000 грн!";                                        
                        cout << "\nПродовжуємо гру\n \nТРЕТЄ ПИТАННЯ\nЯку функцію виконує escape-послідовність \\a?\na: Табуляція         b: Звуковий сигнал\nc: Новий рядок       d: Коментар\n \n";
                        cin >> choice;
                        if (choice == 'b') {
                            cout << "\n                  Вітаємо!!!\n  Ви виграли 10,000 грн.\n  Ви хочете забрати цю суму?\n  Якщо так, натисніть 'y', якщо ні, натисніть 'n'\n \n ";
                            cin >> choice;
                            if (choice == 'y') {
                                cout << "Ви завершили гру і виграли 10,000 грн. ВІТАЄМО!!!\n";
                                return 0;
                            }
                        }
                        else {
                            cout << "Правильна відповідь b: Звуковий сигнал\n Ваш виграш 1,000 грн.\n";
                            return 0;
                        }
                    
                }
                else {
                    cout << "Правильна відповідь c: Прямокутник\n Ваш виграш 0 грн.\n";
                    return 0;
                }
            }
            else {
                cout << "Ви завершили гру і виграли 100 грн. ВІТАЄМО!!!\n";
                return 0;
            }
        }
        else {          
            cout << "Правильна відповідь a: Цілі\n Ваш виграш 0 грн.\n";
            return 0;
        }
        
    }
    else if (choice == 'n') {
        return 0;
    }
    else {
        cout << "ERROR: відповідь має бути або 'y' або 'n'\n";
    }

    if (choice == 'n') {
        cout << "\nПродовжуємо гру\n \nЧЕТВЕРТЕ ПИТАННЯ (Незгоряюча сума!)\nЯкий оператор використовується для отримання залишку від ділення?\na: /           b: %\nc: *           d: //\n \n";
        cin >> choice;
        if (choice == 'b') {
            cout << "\nВітаємо!!! Ви досягли другої незгоряючої суми у 50,000 грн!";
            cout << "\nПродовжуємо гру\n \nП'ЯТЕ ПИТАННЯ\nЯкий цикл виконується хоча б один раз гарантовано?\na: for               b: while\nc: do-while          d: foreach\n \n";
            cin >> choice;
            if (choice == 'c') {
                cout << "\n                  Вітаємо!!!\n  Ви виграли 100,000 грн.\n  Ви хочете забрати цю суму?\n  Якщо так, натисніть 'y', якщо ні, натисніть 'n'\n \n ";
                cin >> choice;
                if (choice == 'n') {
                    cout << "\nПродовжуємо гру\n \nШОСТЕ ПИТАННЯ (фінал)\nЯкий тип даних використовується для збереження символу?\na: int        b: char\nc: string     d: bool\n";
                    cin >> choice;
                    if (choice == 'b') {
                        cout << "\n🏆 ВІТАЄМО!!! ВИ ВІДПОВІЛИ НА ВСІ ЗАПИТАННЯ! ВАШ ВИГРАШ 1,000,000 ГРН! 🏆\n";
                        return 0;
                    }
                    else {
                        cout << "Правильна відповідь b: char\n Ваш виграш 50,000 грн.\n";
                        return 0;
                    }
                }
                else {
                    cout << "Ви завершили гру і виграли 100,000 грн. ВІТАЄМО!!!\n";
                    return 0;
                }
            }
            else {
                cout << "Правильна відповідь c: do-while\n Ваш виграш 50,000 грн.\n";
                return 0;
            }
        }
        else {
            cout << "Правильна відповідь b: %\n Ваш виграш 1,000 грн.\n";
            return 0;
        }
    }

    return 0;
}